# ExternalFileReferenceType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalFileReference..::..ExternalFileReferenceType Property
ExternalFileReference Class See Also
---
The type of external file which this object references.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ExternalFileReferenceType ExternalFileReferenceType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ExternalFileReferenceType As ExternalFileReferenceType
	Get
```

Visual C++
---
```text
public:
property ExternalFileReferenceType ExternalFileReferenceType {
	ExternalFileReferenceType get ();
}
```

# See Also
ExternalFileReference Class
Autodesk.Revit.DB Namespace